Revit 2027 API
BuiltInFailures.StairRampFailures.MayUnjoinRailAndSupports Property
 Fillet may cause the supports unjoin with the rail.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MayUnjoinRailAndSupports { get; }
Public Shared ReadOnly Property MayUnjoinRailAndSupports As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MayUnjoinRailAndSupports {
	FailureDefinitionId^ get ();
}
static member MayUnjoinRailAndSupports : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace